# 1. Мережева модель OSI
# Open Systems Interconnection - система, яка розділяє функції мережевого зв'язку на 7 рівнів.
# OSI є своєрідною мовою для комп'ютерних мереж, тому різні технології можуть взаємодіяти шляхом стандартних протоколів і правил зв'язку.
#Рівні:
#1) фізичний(інтернет-кабелі, дротова мережа тощо);
#2) канальний - зв'язок між пристроями по мережі;
#3) мережевий - Wi-Fi мережа, Ethernet (IPv4, IPv6);
#4) транспортний - забезпечення правильної і безпомилкової передачі даних(TCP, UDP);
#5) сеансовий - мережева координація між двома додатками у сеансі(NFS);
#6) рівень представлення - синтаксис даних, які додатки можуть відправляти та використовувати(JSON, HTML);
#7) прикладний: визначає конкретний тип додатку та якого методів зв'язку(HTTP, HTTPS, TLS, SMTP).

#Доступний діапазон портів 0 - 65535
#Є можливість зайняти порт.

#Мережеві протоколи: UDP(User Diagram Protocol); TCP(Transmission Control Protocol)
#UDP - ненадійний протокол, порядок пакетів може бути порушено, відсутність "рукостискання". Client ----> Server
#TCP - надійний протокол, порядок пакетів дотримано, "рукостискання" наявне, обмін даними.
# Client ----> Server(рукостискання);
# Server -----> Client(З'єднання встановлено),
# Server <----> Client (Обмін даними)

#2. Протокол HTTP
#Стандартний протокол для отримання різних інтернет-ресурсів, наприклад HTML-документів. Він є основою обміну даних в інтернеті.
#HTTP є протоколом "Клієнт - сервер", що означає що запит ініціюється клієнтом(веб-браузером)

#HTTP Client ----> HTTP Server(Запит)
#HTTP Client <---- HTTP Server(Відповідь)

#Найчастіше використовується HTTPS(з TLS протоколом) що надає захищеність даних.

#Статус коди:
#1x - Інформаційні
#2x - Успіх
#3х - Перенаправлення
#4x - Помилка на стороні клієнта
#5x - Помилка на стороні сервера

#Типи запитів:
#GET - отримання ресурсу
#POST - створення ресурсу
#PUT - оновлення ресурсу
#DELETE - видалення ресурсу
#PATCH - частково змінює ресурс




